# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd 
import numpy as np


### Step 2. Create the DataFrame with the following values:

In [5]:
pd.DataFrame(raw_data)

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [6]:
regiment = pd.DataFrame(raw_data)
regiment

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [7]:
mean_preTestScore_nighthawks = regiment[regiment['regiment'] == 'Nighthawks']['preTestScore'].mean()
mean_preTestScore_nighthawks

15.25

### Step 7. Present the mean preTestScores grouped by regiment and company

In [8]:
mean_preTestScores = regiment.groupby(['preTestScore', 'company'])['preTestScore'].mean()
mean_preTestScores

preTestScore  company
2             1st         2.0
              2nd         2.0
3             1st         3.0
              2nd         3.0
4             1st         4.0
24            1st        24.0
              2nd        24.0
31            2nd        31.0
Name: preTestScore, dtype: float64

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [9]:
mean_preTestScores = regiment.groupby(['preTestScore', 'company'])['preTestScore'].mean().reset_index
mean_preTestScores

<bound method Series.reset_index of preTestScore  company
2             1st         2.0
              2nd         2.0
3             1st         3.0
              2nd         3.0
4             1st         4.0
24            1st        24.0
              2nd        24.0
31            2nd        31.0
Name: preTestScore, dtype: float64>

### Step 9. Group the entire dataframe by regiment and company

In [10]:
groupedDF = regiment.groupby(['regiment', 'company'])[['regiment', 'company', 'name', 'preTestScore', 'postTestScore']]
groupedDF
for group, data in groupedDF:
    print("Group:", group)
    print(data)

Group: ('Dragoons', '1st')
   regiment company   name  preTestScore  postTestScore
4  Dragoons     1st  Cooze             3             70
5  Dragoons     1st  Jacon             4             25
Group: ('Dragoons', '2nd')
   regiment company    name  preTestScore  postTestScore
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57
Group: ('Nighthawks', '1st')
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
Group: ('Nighthawks', '2nd')
     regiment company    name  preTestScore  postTestScore
2  Nighthawks     2nd     Ali            31             57
3  Nighthawks     2nd  Milner             2             62
Group: ('Scouts', '1st')
  regiment company   name  preTestScore  postTestScore
8   Scouts     1st  Sloan             2             62
9   Scouts     1st  Piger             3             70
Group: ('Scouts', '2nd')
   regiment company   name  preTestScore  postTestScore
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70

### Step 10. What is the number of observations in each regiment and company

In [11]:
regiment.shape[0]

12

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [13]:

grouped_data = regiment.groupby('regiment')

# Iterate over each group and print the name (regiment) and the whole data for that regiment
for name, data in grouped_data:
    print(f"Regiment: {name}")
    print(data)
    print("\n")

Regiment: Dragoons
   regiment company    name  preTestScore  postTestScore
4  Dragoons     1st   Cooze             3             70
5  Dragoons     1st   Jacon             4             25
6  Dragoons     2nd  Ryaner            24             94
7  Dragoons     2nd    Sone            31             57


Regiment: Nighthawks
     regiment company      name  preTestScore  postTestScore
0  Nighthawks     1st    Miller             4             25
1  Nighthawks     1st  Jacobson            24             94
2  Nighthawks     2nd       Ali            31             57
3  Nighthawks     2nd    Milner             2             62


Regiment: Scouts
   regiment company   name  preTestScore  postTestScore
8    Scouts     1st  Sloan             2             62
9    Scouts     1st  Piger             3             70
10   Scouts     2nd  Riani             2             62
11   Scouts     2nd    Ali             3             70